{
  "es": {
    "docTitle": "Portfolio de Gemma Reina Lara",
    "headerTitle": "Gemma Reina Lara — Portfolio",
    "navSobreMi": "Sobre mí",
    "navVideojuegos": "Videojuegos",
    "navNarrativa": "Narrativa",
    "labelIdioma": "Idioma:",
    "bienvenidaTitulo": "Bienvenid@",
    "bienvenidaTexto": "Este portfolio reúne una selección de mis proyectos de videojuegos y narrativa, tanto personales como académicos. Aquí encontrarás títulos desarrollados en el marco de mis estudios en la Universidad de Girona, junto con proyectos independientes en los que he trabajado por iniciativa propia o en colaboración. En la sección de videojuegos presento cada juego con una descripción detallada de mi rol y una imagen representativa. En narrativa se incluyen fragmentos de mis textos, organizados por obra y protegidos contra copia. Finalmente, en “Sobre mí” puedes consultar mi perfil y trayectoria. Gracias por visitar.",
    "contactoLabel": "Contacto:",
    "perfilesLabel": "Perfiles:",
    "atajosTitulo": "Atajos",
    "atajoSobreMi": "Sobre mí",
    "atajoVideojuegos": "Proyectos de videojuegos",
    "atajoNarrativa": "Textos de narrativa",

    "docTitleSobreMi": "Sobre mí — Gemma Reina Lara",
    "headerTitleSobreMi": "Gemma Reina Lara — Sobre mí",
    "navInicio": "Inicio",
    "sobremiTitulo": "Sobre mí",
    "sobremiTexto": "Soy estudiante de Diseño y Desarrollo de Videojuegos en la Universidad de Girona, con formación en Lenguas y Literatura Clásicas y en Inglés. Aunque mi sueño siempre ha sido ser escritora, mi verdadera pasión son los videojuegos y todo lo que conllevan: quiero saber programar un videojuego desde cero y unir ese conocimiento técnico con mi amor por el storytelling. Soy una persona tímida, pero aprendo rápido y soy perseverante; sé escuchar y adaptarme a lo que la situación requiera. Me apasiona la narración en todas sus formas y creo que los videojuegos son la manera más inmersiva y completa de contar una historia. Mi objetivo es crecer hasta convertirme en diseñadora de narrativa.",

    "docTitleVideojuegos": "Videojuegos — Gemma Reina Lara",
    "headerTitleVideojuegos": "Gemma Reina Lara — Videojuegos",
    "tabLink": "A Link to You",
    "tabMomo": "Momo's Monster Motel",
    "tabGuardian": "Guardian of the Breadth",
    "titleLink": "A Link to You",
    "descLink": "En este proyecto desarrollé tanto la parte narrativa como una pequeña técnica. Escribí la historia completa y todos los diálogos, asegurando coherencia emocional y ritmo dramático. Además, programé la introducción del juego en Unity. Mi rol fue un tanto híbrido: diseñadora narrativa y pequeña programadora, lo que me permitió unir guion y jugabilidad en una experiencia cohesiva.",
    "titleMomo": "Momo's Monster Motel",
    "descMomo": "En este juego universitario participé escribiendo las historias de varios personajes, incluyendo sus trasfondos y motivaciones. También programé la introducción y parte de las interacciones iniciales en Unreal Engine. Mi rol fue principalmente narrativo, pero con aportes técnicos para asegurar que los diálogos y eventos se integraran correctamente en el motor.",
    "titleGuardian": "Guardian of the Breadth",
    "descGuardian": "En este proyecto universitario escribí la historia completa y diseñé el sistema de diálogos. Además, programé un puzle de candado de combinación y la lógica narrativa que guía al jugador. Mi rol fue unir narrativa y mecánicas, asegurando que la historia se transmitiera a través de la jugabilidad.",

    "docTitleNarrativa": "Narrativa — Gemma Reina Lara",
    "headerTitleNarrativa": "Gemma Reina Lara — Narrativa",
    "tabDestellos": "Destellos en el horizonte"
},
  "en": {
    "docTitle": "Gemma Reina Lara — Portfolio",
    "headerTitle": "Gemma Reina Lara — Portfolio",
    "navSobreMi": "About Me",
    "navVideojuegos": "Games",
    "navNarrativa": "Narrative",
    "labelIdioma": "Language:",
    "bienvenidaTitulo": "Welcome",
    "bienvenidaTexto": "This portfolio showcases a selection of my game and narrative projects, both personal and academic. It includes titles developed during my studies at the University of Girona, as well as independent projects created on my own or in collaboration. In the Games section, each project includes a detailed description of my role and a representative image. In Narrative, you’ll find excerpts from my texts, organized by work and protected from copying. Finally, in 'About Me' you can read about my background and profile. Thank you for visiting.",
    "contactoLabel": "Contact:",
    "perfilesLabel": "Profiles:",
    "atajosTitulo": "Shortcuts",
    "atajoSobreMi": "About Me",
    "atajoVideojuegos": "Game Projects",
    "atajoNarrativa": "Narrative Texts",

    "docTitleSobreMi": "About Me — Gemma Reina Lara",
    "headerTitleSobreMi": "Gemma Reina Lara — About Me",
    "navInicio": "Home",
    "sobremiTitulo": "About Me",
    "sobremiTexto": "I am a student of Game Design and Development at the University of Girona, with a background in Classical Languages and Literature as well as English. Although my dream has always been to be a writer, my true passion is video games and everything they involve: I want to learn how to program a game from scratch and combine that technical knowledge with my love for storytelling. I am a shy person, but I learn quickly and I am perseverant; I know how to listen and adapt to what each situation requires. I am passionate about storytelling in all its forms and I believe video games are the most immersive and complete way to tell a story. My goal is to grow into becoming a narrative designer.",

    "docTitleVideojuegos": "Games — Gemma Reina Lara",
    "headerTitleVideojuegos": "Gemma Reina Lara — Games",
    "tabLink": "A Link to You",
    "tabMomo": "Momo's Monster Motel",
    "tabGuardian": "Guardian of the Breadth",
    "titleLink": "A Link to You",
    "descLink": "In this project I developed both the narrative and a small technical part. I wrote the complete story and all the dialogues, ensuring emotional coherence and dramatic rhythm. In addition, I programmed the introduction of the game in Unity. My role was somewhat hybrid: narrative designer and junior programmer, which allowed me to merge script and gameplay into a cohesive experience.",
    "titleMomo": "Momo's Monster Motel",
    "descMomo": "In this university game I participated by writing the stories of several characters, including their backgrounds and motivations. I also programmed the introduction and part of the initial interactions in Unreal Engine. My role was mainly narrative, but with technical contributions to ensure that dialogues and events were correctly integrated into the engine.",
    "titleGuardian": "Guardian of the Breadth",
    "descGuardian": "In this university project I wrote the complete story and designed the dialogue system. In addition, I programmed a combination lock puzzle and the narrative logic that guides the player. My role was to merge narrative and mechanics, ensuring that the story was conveyed through gameplay.",

    "docTitleNarrativa": "Narrative — Gemma Reina Lara",
    "headerTitleNarrativa": "Gemma Reina Lara — Narrative",
    "tabDestellos": "Glimmers on the Horizon"
  },
  "ca": {
    "docTitle": "Portafoli de Gemma Reina Lara",
    "headerTitle": "Gemma Reina Lara — Portafoli",
    "navSobreMi": "Sobre mi",
    "navVideojuegos": "Videojocs",
    "navNarrativa": "Narrativa",
    "labelIdioma": "Idioma:",
    "bienvenidaTitulo": "Benvinguda",
    "bienvenidaTexto": "Aquest portafoli recull una selecció dels meus projectes de videojocs i narrativa, tant personals com acadèmics. Inclou títols desenvolupats durant els meus estudis a la Universitat de Girona, així com projectes independents creats per iniciativa pròpia o en col·laboració. A la secció de Videojocs, cada projecte inclou una descripció detallada del meu rol i una imatge representativa. A Narrativa hi trobaràs fragments dels meus textos, organitzats per obra i protegits contra la còpia. Finalment, a 'Sobre mi' pots consultar el meu perfil i trajectòria. Gràcies per visitar.",
    "contactoLabel": "Contacte:",
    "perfilesLabel": "Perfils:",
    "atajosTitulo": "Dreceres",
    "atajoSobreMi": "Sobre mi",
    "atajoVideojuegos": "Projectes de videojocs",
    "atajoNarrativa": "Textos de narrativa",

    "docTitleSobreMi": "Sobre mi — Gemma Reina Lara",
    "headerTitleSobreMi": "Gemma Reina Lara — Sobre mi",
    "navInicio": "Inici",
    "sobremiTitulo": "Sobre mi",
    "sobremiTexto": "Sóc estudiant de Disseny i Desenvolupament de Videojocs a la Universitat de Girona, amb formació en Llengües i Literatura Clàssiques i en Anglès. Tot i que el meu somni sempre ha estat ser escriptora, la meva veritable passió són els videojocs i tot el que comporten: vull aprendre a programar un videojoc des de zero i unir aquest coneixement tècnic amb el meu amor pel storytelling. Sóc una persona tímida, però aprenc ràpid i sóc perseverant; sé escoltar i adaptar-me al que la situació requereixi. M'apassiona la narració en totes les seves formes i crec que els videojocs són la manera més immersiva i completa d'explicar una història. El meu objectiu és créixer fins a convertir-me en dissenyadora de narrativa.",

    "docTitleVideojuegos": "Videojocs — Gemma Reina Lara",
    "headerTitleVideojuegos": "Gemma Reina Lara — Videojocs",
    "tabLink": "A Link to You",
    "tabMomo": "Momo's Monster Motel",
    "tabGuardian": "Guardian of the Breadth",
    "titleLink": "A Link to You",
    "descLink": "En aquest projecte vaig desenvolupar tant la part narrativa com una petita tècnica. Vaig escriure la història completa i tots els diàlegs, assegurant coherència emocional i ritme dramàtic. A més, vaig programar la introducció del joc en Unity. El meu rol va ser una mica híbrid: dissenyadora narrativa i petita programadora, cosa que em va permetre unir guió i jugabilitat en una experiència cohesionada.",
    "titleMomo": "Momo's Monster Motel",
    "descMomo": "En aquest joc universitari vaig participar escrivint les històries de diversos personatges, incloent els seus trasfons i motivacions. També vaig programar la introducció i part de les interaccions inicials en Unreal Engine. El meu rol va ser principalment narratiu, però amb aportacions tècniques per assegurar que els diàlegs i esdeveniments s'integressin correctament al motor.",
    "titleGuardian": "Guardian of the Breadth",
    "descGuardian": "En aquest projecte universitari vaig escriure la història completa i vaig dissenyar el sistema de diàlegs. A més, vaig programar un trencaclosques de pany de combinació i la lògica narrativa que guia el jugador. El meu rol va ser unir narrativa i mecàniques, assegurant que la història es transmetés a través de la jugabilitat." ,
    
    "docTitleNarrativa": "Narrativa — Gemma Reina Lara",
    "headerTitleNarrativa": "Gemma Reina Lara — Narrativa",
    "tabDestellos": "Destells a l'horitzó"
}
}